# -*- coding: utf-8 -*-
import numpy as np
import cv2


def load_tools():
    """
         Функция осуществляет загрузку данных из файлов.
         Вы можете приложить к решению можете приложить к решению изображения с шаблонами или
         модели машинного обучения.

         Выходные данные: список с данными, извлечёнными из файлов.

         Примеры выходных данных: [template_img_1, template_img_2]
                                  [model_1, model_2]
                                  [img1, img2, img3, model_1, model_2]
                                  []

         Если вы не собираетесь использовать эту функцию, пусть возвращает пустой список [].

         Список, который вернёт эта функция, будет передан вторым аргументом в predict_sticker.
    """

    return []


def predict_sticker(image: np.ndarray, tools_list: list) -> tuple:
    """
         Функция детектирования и распознавания на изображении маркировки типа топлива.
         Входные данные: изображение (bgr), прочитанное cv2.imread.
         Выходные данные: (x1, y1, x2, y2), "Type"

                          (x1, y1, x2, y2) - координаты левого верхнего и правого нижнего угла
                                             ограничивающего маркировку прямоугольника.

                          "Type" - строка с типом топлива, изображённым на маркировке.
                                   Возможны три варианта: "Petrol", "Diesel", "Energy".

         Пример вывода: (611, 679, 696, 735), "Energy"
    """


    return (611, 679, 696, 735), "Energy"
