# -*- coding: utf-8 -*-
import cv2
import numpy as np

def load_tools():
    """
         Функция осуществляет загрузку данных из файлов.
         Вы можете приложить к решению можете приложить к решению изображения с шаблонами или
         модели машинного обучения.

         Выходные данные: список с данными, извлечёнными из файлов.

         Примеры выходных данных: [template_img_1, template_img_2]
                                  [model_1, model_2]
                                  [img1, img2, img3, model_1, model_2]
                                  []

         Если вы не собираетесь использовать эту функцию, пусть возвращает пустой список [].

         Список, который вернёт эта функция, будет передан вторым аргументом в predict_violations.
    """

    return []



def predict_violations(video: cv2.VideoCapture, tools_list: list) -> list:
    """
         Функция определяющая скорости автомобилей на видео.
         Входные данные: объект, возвращаемый cv2.VideoCapture
         Выходные данные: список скоростей автомобилей.
                          Скорости должны быть в порядке полного исчезновения
                          соответствующих машин из кадра.

         Примеры вывода: [18, 30] - два автомобиля покинули кадр.
                         [] - автомобили не покидали кадр.
    """


    return [18, 30]
